McMCCRU/rtl8188gu/hal/rtl8710b/rtl8710b_phycfg.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#define _RTL8710B_PHYCFG_C_

#include <rtl8710b_hal.h>


/*---------------------------Define Local Constant---------------------------*/
/* Channel switch:The size of command tables for switch channel*/
#define MAX_PRECMD_CNT 16
#define MAX_RFDEPENDCMD_CNT 16
#define MAX_POSTCMD_CNT 16

#define MAX_DOZE_WAITING_TIMES_9x 64

/*---------------------------Define Local Constant---------------------------*/


/*------------------------Define global variable-----------------------------*/

/*------------------------Define local variable------------------------------*/


/*--------------------Define export function prototype-----------------------*/
/* Please refer to header file
 *--------------------Define export function prototype-----------------------*/

/*----------------------------Function Body----------------------------------*/
/*
 * 1. BB register R/W API
 *   */

/**
* Function:	phy_CalculateBitShift
*
* OverView:	Get shifted position of the BitMask
*
* Input:
*			u4Byte		BitMask,
*
* Output:	none
* Return:		u4Byte		Return the shift bit bit position of the mask
*/
static	u32
phy_CalculateBitShift(
	u32 BitMask
)
{
	u32 i;

	for (i = 0; i <= 31; i++) {
		if (((BitMask >> i) &  0x1) == 1)
			break;
	}

	return i;
}


/**
* Function:	PHY_QueryBBReg
*
* OverView:	Read "sepcific bits" from BB register
*
* Input:
*			PADAPTER		Adapter,
*			u4Byte			RegAddr,
*			u4Byte			BitMask
*
* Output:	None
* Return:		u4Byte			Data
* Note:		This function is equal to "GetRegSetting" in PHY programming guide
*/
u32
PHY_QueryBBReg_8710B(
	IN	PADAPTER	Adapter,
	IN	u32		RegAddr,
	IN	u32		BitMask
)
{
	u32	ReturnValue = 0, OriginalValue, BitShift;
	u16	BBWaitCounter = 0;

#if (DISABLE_BB_RF == 1)
	return 0;
#endif


	OriginalValue = rtw_read32(Adapter, RegAddr);
	BitShift = phy_CalculateBitShift(BitMask);
	ReturnValue = (OriginalValue & BitMask) >> BitShift;
	//RTW_INFO("PHY_QueryBBReg_8710B : RegAddr=0x%x \n", RegAddr);
	return ReturnValue;

}


/**
* Function:	PHY_SetBBReg
*
* OverView:	Write "Specific bits" to BB register (page 8~)
*
* Input:
*			PADAPTER		Adapter,
*			u4Byte			RegAddr,
*			u4Byte			BitMask
*
*			u4Byte			Data
*
*
* Output:	None
* Return:		None
* Note:		This function is equal to "PutRegSetting" in PHY programming guide
*/

VOID
PHY_SetBBReg_8710B(
	IN	PADAPTER	Adapter,
	IN	u32		RegAddr,
	IN	u32		BitMask,
	IN	u32		Data
)
{
	HAL_DATA_TYPE	*pHalData		= GET_HAL_DATA(Adapter);
	/* u16			BBWaitCounter	= 0; */
	u32			OriginalValue, BitShift;

#if (DISABLE_BB_RF == 1)
	return;
#endif


	if (BitMask != bMaskDWord) { /* if not "double word" write */
		OriginalValue = rtw_read32(Adapter, RegAddr);
		BitShift = phy_CalculateBitShift(BitMask);
		Data = ((OriginalValue & (~BitMask)) | ((Data << BitShift) & BitMask));
	}
	
	//RTW_INFO("PHY_SetBBReg_8710B : RegAddr=0x%x  Data=0x%x\n", RegAddr, Data);
	rtw_write32(Adapter, RegAddr, Data);

}


/*
 * 2. RF register R/W API
 *   */

/*-----------------------------------------------------------------------------
 * Function:	phy_FwRFSerialRead()
 *
 * Overview:	We support firmware to execute RF-R/W.
 *
 * Input:		NONE
 *
 * Output:		NONE
 *
 * Return:		NONE
 *
 * Revised History:
 *	When		Who		Remark
 *	01/21/2008	MHC		Create Version 0.
 *
 *---------------------------------------------------------------------------*/
static	u32
phy_FwRFSerialRead(
	IN	PADAPTER			Adapter,
	IN	enum rf_path			eRFPath,
	IN	u32				Offset)
{
	u32		retValue = 0;
	/* RT_ASSERT(FALSE,("deprecate!\n")); */
	return	retValue;

}	/* phy_FwRFSerialRead */


/*-----------------------------------------------------------------------------
 * Function:	phy_FwRFSerialWrite()
 *
 * Overview:	We support firmware to execute RF-R/W.
 *
 * Input:		NONE
 *
 * Output:		NONE
 *
 * Return:		NONE
 *
 * Revised History:
 *	When		Who		Remark
 *	01/21/2008	MHC		Create Version 0.
 *
 *---------------------------------------------------------------------------*/
static	VOID
phy_FwRFSerialWrite(
	IN	PADAPTER			Adapter,
	IN	enum rf_path			eRFPath,
	IN	u32				Offset,
	IN	u32				Data)
{
	/* RT_ASSERT(FALSE,("deprecate!\n")); */
}

static	u32
phy_RFSerialRead_8710B(
	IN	PADAPTER			Adapter,
	IN	enum rf_path			eRFPath,
	IN	u32				Offset
)
{
	u32						retValue = 0;
	HAL_DATA_TYPE				*pHalData = GET_HAL_DATA(Adapter);
	BB_REGISTER_DEFINITION_T	*pPhyReg = &pHalData->PHYRegDef[eRFPath];
	u32						NewOffset;
	u32						tmplong, tmplong2;
	u8					RfPiEnable = 0;
	u32						MaskforPhySet = 0;
	int i = 0;

	u8 cnt = 0;
	u32 reg_addr = pPhyReg->rfLSSIReadBack;//0x8a0
	u32 value32;
	BOOLEAN err_flag = _TRUE;
	
	_enter_critical_mutex(&(adapter_to_dvobj(Adapter)->rf_read_reg_mutex) , NULL);

	Offset &= 0xff;

	value32 = phy_query_bb_reg(Adapter, rFPGA0_XA_HSSIParameter2, bMaskDWord);
	value32 = (value32 & (~bLSSIReadAddress)) | (Offset<<23);
	phy_set_bb_reg(Adapter, rFPGA0_XA_HSSIParameter2, bMaskDWord, value32 & (~bLSSIReadEdge));			
	phy_set_bb_reg(Adapter, rFPGA0_XA_HSSIParameter2, bMaskDWord, value32 | bLSSIReadEdge);		


	//===>add by ylb 20170322, delay 120us is not enough, so wait for BB(%x)[20] is 1
	if(phy_query_bb_reg(Adapter, REG_FPGA0_XA_HSSI_PARAMETER1, BIT8))
		reg_addr = pPhyReg->rfLSSIReadBackPi;//0x8b8

	do
	{
		rtw_udelay_os(120);
		
		retValue = phy_query_bb_reg(Adapter, reg_addr, bMaskDWord);
		if (retValue & BIT20)
		{
			err_flag = _FALSE;
			break;

		}
		RTW_DBG("phy_RFSerialRead, BB(%x) = %x, Cnt=%x\n", reg_addr, retValue, cnt);
		
	}while(cnt++ < 0x5);
	//<===add by ylb 20170322, delay 120us is not enough, so wait for BB(%x)[20] is 1

	retValue &= bLSSIReadBackData;
	if((0x18 == Offset) && (err_flag == _TRUE))
	{
		retValue &= 0xFFF;
		RTW_DBG("phy_RFSerialRead(): Offset(%#x), retValue(%#x), eRFPath(%#x)\n", Offset, retValue, eRFPath);
	}
	
