McMCCRU/rtl8188gu/hal/rtl8710b/rtl8710b_phycfg.c
	/* --- Notch Filter --- Asked by Rock	 */
	if (b_doNotch) {
		CurrentChannel = odm_get_rf_reg(pDM_Odm, RF_PATH_A, RF_CHNLBW, bRFRegOffsetMask);
		wlan_channel   = CurrentChannel & 0x0f;						    /* Get center frequency */

		switch (wlan_channel) {											/* Set notch filter				 */
		case 13:
			odm_set_bb_reg(pDM_Odm, 0xC40, BIT(28) | BIT(27) | BIT(26) | BIT(25) | BIT(24), 0xB);
			odm_set_bb_reg(pDM_Odm, 0xC40, BIT(9), 0x1);                    /* enable notch filter */
			odm_set_bb_reg(pDM_Odm, 0xD40, bMaskDWord, 0x04000000);
			odm_set_bb_reg(pDM_Odm, 0xD44, bMaskDWord, 0x00000000);
			odm_set_bb_reg(pDM_Odm, 0xD48, bMaskDWord, 0x00000000);
			odm_set_bb_reg(pDM_Odm, 0xD4C, bMaskDWord, 0x00000000);
			odm_set_bb_reg(pDM_Odm, 0xD2C, BIT(28), 0x1);                   /* enable CSI mask */
			break;
		case 14:
			odm_set_bb_reg(pDM_Odm, 0xC40, BIT(28) | BIT(27) | BIT(26) | BIT(25) | BIT(24), 0x5);
			odm_set_bb_reg(pDM_Odm, 0xC40, BIT(9), 0x1);                   /* enable notch filter */
			odm_set_bb_reg(pDM_Odm, 0xD40, bMaskDWord, 0x00000000);
			odm_set_bb_reg(pDM_Odm, 0xD44, bMaskDWord, 0x00000000);
			odm_set_bb_reg(pDM_Odm, 0xD48, bMaskDWord, 0x00000000);
			odm_set_bb_reg(pDM_Odm, 0xD4C, bMaskDWord, 0x00080000);
			odm_set_bb_reg(pDM_Odm, 0xD2C, BIT(28), 0x1);                   /* enable CSI mask */
			break;
		default:
			odm_set_bb_reg(pDM_Odm, 0xC40, BIT(9), 0x0);						/* disable notch filter */
			odm_set_bb_reg(pDM_Odm, 0xD2C, BIT(28), 0x0);                   /* disable CSI mask	function */
			break;
		} /* switch(wlan_channel)	 */
		return;
	}

	odm_set_bb_reg(pDM_Odm, 0xC40, BIT(28) | BIT(27) | BIT(26) | BIT(25) | BIT(24), 0x1f);
	odm_set_bb_reg(pDM_Odm, 0xC40, BIT(9), 0x0);                     /* disable notch filter */
	odm_set_bb_reg(pDM_Odm, 0xD40, bMaskDWord, 0x00000000);
	odm_set_bb_reg(pDM_Odm, 0xD44, bMaskDWord, 0x00000000);
	odm_set_bb_reg(pDM_Odm, 0xD48, bMaskDWord, 0x00000000);
	odm_set_bb_reg(pDM_Odm, 0xD4C, bMaskDWord, 0x00000000);
	odm_set_bb_reg(pDM_Odm, 0xD2C, BIT(28), 0x0);                    /* disable CSI mask */
}

VOID
phy_SetRegBW_8710B(
	IN	PADAPTER		Adapter,
	enum channel_width	CurrentBW
)
{
	u16	RegRfMod_BW, u2tmp = 0;

	RegRfMod_BW = rtw_read16(Adapter, REG_TRXPTCL_CTL_8710B);

	switch (CurrentBW) {
	case CHANNEL_WIDTH_20:
		rtw_write16(Adapter, REG_TRXPTCL_CTL_8710B, (RegRfMod_BW & 0xFE7F)); /* BIT 7 = 0, BIT 8 = 0 */
		break;

	case CHANNEL_WIDTH_40:
		u2tmp = RegRfMod_BW | BIT(7);
		rtw_write16(Adapter, REG_TRXPTCL_CTL_8710B, (u2tmp & 0xFEFF)); /* BIT 7 = 1, BIT 8 = 0 */
		break;

	default:
		RTW_INFO("phy_PostSetBWMode8710B(): unknown Bandwidth: %#X\n", CurrentBW);
		break;
	}
}

u8
phy_GetSecondaryChnl_8710B(
	IN	PADAPTER	Adapter
)
{
	u8	SCSettingOf40 = 0, SCSettingOf20 = 0;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(Adapter);

	if (pHalData->current_channel_bw == CHANNEL_WIDTH_80) {
		if (pHalData->nCur80MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_LOWER)
			SCSettingOf40 = VHT_DATA_SC_40_LOWER_OF_80MHZ;
		else if (pHalData->nCur80MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_UPPER)
			SCSettingOf40 = VHT_DATA_SC_40_UPPER_OF_80MHZ;


		if ((pHalData->nCur40MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_LOWER) && (pHalData->nCur80MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_LOWER))
			SCSettingOf20 = VHT_DATA_SC_20_LOWEST_OF_80MHZ;
		else if ((pHalData->nCur40MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_UPPER) && (pHalData->nCur80MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_LOWER))
			SCSettingOf20 = VHT_DATA_SC_20_LOWER_OF_80MHZ;
		else if ((pHalData->nCur40MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_LOWER) && (pHalData->nCur80MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_UPPER))
			SCSettingOf20 = VHT_DATA_SC_20_UPPER_OF_80MHZ;
		else if ((pHalData->nCur40MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_UPPER) && (pHalData->nCur80MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_UPPER))
			SCSettingOf20 = VHT_DATA_SC_20_UPPERST_OF_80MHZ;

	} else if (pHalData->current_channel_bw == CHANNEL_WIDTH_40) {

		if (pHalData->nCur40MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_UPPER)
			SCSettingOf20 = VHT_DATA_SC_20_UPPER_OF_80MHZ;
		else if (pHalData->nCur40MhzPrimeSC == HAL_PRIME_CHNL_OFFSET_LOWER)
			SCSettingOf20 = VHT_DATA_SC_20_LOWER_OF_80MHZ;

	}

	return (SCSettingOf40 << 4) | SCSettingOf20;
}

void
phy_PostSetBwMode8710B(
	IN PADAPTER padapter
)
{
	u1Byte SubChnlNum = 0;
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);

	phy_SetRegBW_8710B(padapter, pHalData->current_channel_bw);

	SubChnlNum = phy_GetSecondaryChnl_8710B(padapter);
	rtw_write8(padapter, REG_DATA_SC_8710B, SubChnlNum);

	switch (pHalData->current_channel_bw) {
	case CHANNEL_WIDTH_20:
		phy_set_bb_reg(padapter, REG_FPGA0_RFMOD, bRFMOD, 0x0);			
		phy_set_bb_reg(padapter, rFPGA1_RFMOD, bRFMOD, 0x0);
		phy_set_bb_reg(padapter, REG_FPGA0_RFMOD, BIT10|BIT9|BIT8, 0x7);	//0x800[10:8] = 3'b111		
		phy_set_bb_reg(padapter, REG_FPGA0_RFMOD, BIT14|BIT13|BIT12, 0x5); //0x800[14:12] = 3'b101 	
		phy_set_bb_reg(padapter, rOFDM0_TxPseudoNoiseWgt, BIT31|BIT30, 0x0); //0xCE4[31:30] = 2'00 		
		phy_set_bb_reg(padapter, rOFDM0_TxPseudoNoiseWgt, BIT29|BIT28, 0x1); //0xCE4[29:28] = 2'01 	
		phy_set_bb_reg(padapter, rOFDM0_XARxAFE, BIT29|BIT28, 0x1); //0xC10[29:28] = 2'01	
		phy_set_bb_reg(padapter, REG_FPGA0_XB_RF_INTERFACE_OE, BIT30|BIT29, 0x1); //0x864[30:29] = 2'01	
		phy_set_bb_reg(padapter, rBBrx_DFIR, BIT19, 1); //0x954[19] = 1
		phy_set_bb_reg(padapter, rBBrx_DFIR, (BIT23|BIT22|BIT21|BIT20), 0x8); //0x954[23:20] = 4'1000
		phy_set_bb_reg(padapter, rBBrx_DFIR, (BIT27|BIT26|BIT25|BIT24), 0xa); //0x954[27:24] = 4'1010

		phy_set_rf_reg(padapter, RF_PATH_A, RF_CHNLBW, (BIT11|BIT10), 0x3);
		break;

	case CHANNEL_WIDTH_40:
		phy_set_bb_reg(padapter, REG_FPGA0_RFMOD, bRFMOD, 0x1);			
		phy_set_bb_reg(padapter, rFPGA1_RFMOD, bRFMOD, 0x1);
		phy_set_bb_reg(padapter, rCCK0_System, bCCKSideBand, (pHalData->nCur40MhzPrimeSC>>1));
		phy_set_bb_reg(padapter, REG_FPGA0_RFMOD, BIT10|BIT9|BIT8, 0x7);	//0x800[10:8] = 3'b111		
		phy_set_bb_reg(padapter, REG_FPGA0_RFMOD, BIT14|BIT13|BIT12, 0x5); //0x800[14:12] = 3'b101 	
		phy_set_bb_reg(padapter, rOFDM0_TxPseudoNoiseWgt, BIT31|BIT30, 0x0); //0xCE4[31:30] = 2'00 		
		phy_set_bb_reg(padapter, rOFDM0_TxPseudoNoiseWgt, BIT29|BIT28, 0x1); //0xCE4[29:28] = 2'01 	
		phy_set_bb_reg(padapter, rOFDM0_XARxAFE, BIT29|BIT28, 0x1); //0xC10[29:28] = 2'01	
		phy_set_bb_reg(padapter, REG_FPGA0_XB_RF_INTERFACE_OE, BIT30|BIT29, 0x1); //0x864[30:29] = 2'01	
		phy_set_bb_reg(padapter, rBBrx_DFIR, BIT19, 0); //0x954[19] = 0
		phy_set_bb_reg(padapter, rBBrx_DFIR, (BIT23|BIT22|BIT21|BIT20), 0x0); //0x954[23:20] = 0
		phy_set_bb_reg(padapter, rBBrx_DFIR, (BIT27|BIT26|BIT25|BIT24), 0x0); //0x954[27:24] = 0

		phy_set_rf_reg(padapter, RF_PATH_A, RF_CHNLBW, (BIT11|BIT10), 0x1);
		break;
		
	default:
		break;
	}
}

VOID
phy_ReviseCCKTxPSF8710B(	
	IN	PADAPTER		pAdapter, 
	IN	u1Byte			channelToSW
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(pAdapter);
	
	if(channelToSW == 14)
	{
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[0].offset, bMaskDWord, 0x0000B81C);//0xA24
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[1].offset, bMaskDWord, 0x00000000); //0xA28
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[2].offset, bMaskDWord, 0x00003667); //0xAAC
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[3].offset, bMaskDWord, pHalData->RegForRecover[3].value); //0xA20
	}
	else if(channelToSW == 13)
	{
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[0].offset, bMaskDWord, pHalData->RegForRecover[0].value);
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[1].offset, bMaskDWord, pHalData->RegForRecover[1].value);
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[2].offset, bMaskDWord, pHalData->RegForRecover[2].value);
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[3].offset, bMaskDWord, 0xd1d80001);
	}
	else
	{
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[0].offset, bMaskDWord, pHalData->RegForRecover[0].value);
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[1].offset, bMaskDWord, pHalData->RegForRecover[1].value);
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[2].offset, bMaskDWord, pHalData->RegForRecover[2].value);
		phy_set_bb_reg(pAdapter, pHalData->RegForRecover[3].offset, bMaskDWord, pHalData->RegForRecover[3].value);
	}
}

VOID
phy_SwChnl8710B(
	IN	PADAPTER					pAdapter
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(pAdapter);
	u8		channelToSW = pHalData->current_channel;
	u8		i = 0;

	if (pHalData->rf_chip == RF_PSEUDO_11N) {
		RTW_WARN("phy_SwChnl8710B: return for PSEUDO\n");
		return;
	}
	
	//phydm_config_kfree(GET_PDM_ODM(pAdapter), channelToSW);
	phy_set_rf_reg(pAdapter, RF_PATH_A, RF_CHNLBW, 0x3FF, channelToSW);
	
	//suggested by mingzhi_guo, 20170906
	phy_ReviseCCKTxPSF8710B(pAdapter, channelToSW);
	
	//phy_SpurCalibration_8710B(pAdapter, channelToSW, 0x16);

	RTW_DBG("===>phy_SwChnl8710B: Channel = %d\n", channelToSW);
}

VOID
phy_SwChnlAndSetBwMode8710B(
	IN  PADAPTER		Adapter
)
{
	HAL_DATA_TYPE		*pHalData = GET_HAL_DATA(Adapter);

